:PROPERTIES:
:ID:       f02ad605-0ff9-4546-9500-135327f2f104
:END:
#+title: Doom Emacs
#+filetags: :vim:emacs:evil:emacs_lisp:emacs_configuration:doom_emacs:
* fill-column-indicator
Source: [2021-08-28 Sat], [[https://github.com/hlissner/doom-emacs/issues/5243#issuecomment-875709373][hlissner/doom-emacs#5243 fill-column indicator module is no longer working af...]]
 #+BEGIN_QUOTE
display-fill-column-indicator is built into Emacs 27.1+. To activate it add (add-hook 'doom-first-buffer-hook #'global-display-fill-column-indicator-mode) to your config, or (add-hook! (prog-mode conf-mode text-mode) #'display-fill-column-indicator-mode) -- whichever you prefer.
#+END_QUOTE
#+begin_src clojure
(if (< (rand) 0.5) '(add-hook 'doom-first-buffer-hook #'global-display-fill-column-indicator-mode) '(add-hook! (prog-mode conf-mode text-mode) #'display-fill-column-indicator-mode))
#+end_src

#+RESULTS:
| add-hook | 'doom-first-buffer-hook | (var global-display-fill-column-indicator-mode) |
